ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tcpwm_shiftreg.h
/***************************************************************************//**
* \file cy_tcpwm_shiftreg.h
* \version 1.20
*
* \brief
* The header file of the TCPWM Shift Register driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#if !defined(CY_TCPWM_SHIFTREG_H)
#define CY_TCPWM_SHIFTREG_H

#include "cy_tcpwm.h"

#ifdef CY_IP_MXTCPWM

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_tcpwm_shiftreg
* Driver API for Shift Register.
*
* The functions and other declarations used in this part of the driver are in cy_tcpwm_shiftreg.h.
* You can also include cy_pdl.h to get access to all functions and declarations in the PDL.
*
* Shift Register functionality shifts the counter value to the right.
* A shift register is used to apply a signal delay function which can be used
* eg: in detecting frequency shift keying (FSK) signals.
* A shift register is also used in parallel-in to serial-out data conversion
* and serial-in to parallel-out data conversion.
*
* Features:
* * 16- or 32-bit Counter
* * 2 compare (CC0/CC1) registers with double buffer.
* * Programmable Counter taps through PERIOD_BUFF register.
* * Line output generated from a XOR combination of all enabled counter taps (bit position) defined by PERIOD_BUFF.
* * Programmable Compare Register. Compare value can be swapped with a buffered compare value on comparison event.
* * Interrupt on Comparision match events (CC0_MATCH/CC1_MATCH).
* * Start, Reload, Stop, Shift, and Serail-in Inputs.
* * Comparision match and Line Outputs.
* * Line output can be output with invert polarity.
*
* \note Shift Register mode is available only in TCPWM Version 2
*
* \section group_tcpwm_shiftreg_configuration Configuration Considerations
* The Shift Register configuration can be divided to number of sequential
* steps listed below:
* * \ref group_tcpwm_shiftreg_config
* * \ref group_tcpwm_shiftreg_pins
* * \ref group_tcpwm_shiftreg_clock
* * \ref group_tcpwm_shiftreg_enable
* * \ref group_tcpwm_shiftreg_start
*
* \subsection group_tcpwm_shiftreg_config Configure Shift Register
* To configure Shift Register, provide the configuration parameters in the
* \ref cy_stc_tcpwm_shiftreg_config_t structure. The configuration structure
* can be modified through software, but if the configurator in ModusToolbox is used
* then the configuration structure will be updated with the users inputs. To initialize
* the driver, call \ref Cy_TCPWM_ShiftReg_Init function providing a pointer to the
* populated \ref cy_stc_tcpwm_shiftreg_config_t structure.
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Init
*
* \subsection group_tcpwm_shiftreg_pins Assign and Configure Pins
* The dedicated TCPWM pins can be used. The HSIOM register must be configured to
* connect the block to the pins. Use the \ref group_gpio driver API to do that.
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Pins
*
* \subsection group_tcpwm_shiftreg_clock Assign Clock Divider
* The clock source must be connected for proper operation.
* Any of the peripheral clock dividers could be used. Use the
* \ref group_sysclk driver API to do that.
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Clock
*
* \subsection group_tcpwm_shiftreg_enable Enable Shift Register
* Shift Register has to be enabled before starting
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Enable
*
* \subsection group_tcpwm_shiftreg_start Start Shift Register
* To start Shift Register operation \ref Cy_TCPWM_TriggerStart_Single API can be used.
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Start
* \{
*/

/**
* \defgroup group_tcpwm_macros_shiftreg          Macros
* \defgroup group_tcpwm_functions_shiftreg       Functions
* \defgroup group_tcpwm_data_structures_shiftreg Data Structures
* \} */

/**
* \addtogroup group_tcpwm_data_structures_shiftreg
* \{
*/

#if (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN)
/** Shift Register configuration structure */
typedef struct cy_stc_tcpwm_shiftreg_config
{
    uint32_t    clockPrescaler;     /**< Sets the clock prescaler inside the TCWPM block.*/
    uint32_t    tapsEnabled;        /**< In shift register this sets the enabled taps. */
    uint32_t    compare0;           /**< Sets the value for Compare 0. */
    uint32_t    compareBuf0;        /**< Sets the value for the buffered Compare 0. */
    bool        enableCompare0Swap; /**< If enabled, the compare 0 values are swapped on the terminal count. */
    uint32_t    compare1;           /**< Sets the value for Compare 1. */
    uint32_t    compareBuf1;        /**< Sets the value for the buffered Compare 1. */
    bool        enableCompare1Swap; /**< If enabled, the compare1 values are swapped on the terminal count. */
    uint32_t    interruptSources;   /**< Enables an interrupt on the terminal count, capture or compare.  */
    uint32_t    invertShiftRegOut;  /**< Inverts the ShiftReg output.*/
    uint32_t    invertShiftRegOutN; /**< Inverts the ShiftReg compliment output.*/
    uint32_t    reloadInputMode;    /**< Configures how the reload input behaves.  */
    uint32_t    reloadInput;        /**< Selects which input the reload uses. The inputs are device-specific.  */
    uint32_t    startInputMode;     /**< Configures how the start input behaves. See \ref group_tcpwm_input_modes. */
    uint32_t    startInput;         /**< Selects which input the start uses. The inputs are device-specific. */
    uint32_t    killInputMode;      /**< Configures how the kill0 input behaves. */
    uint32_t    killInput;          /**< Selects which input the kill0 uses. The inputs are device-specific. */
    uint32_t    shiftInputMode;     /**< Configures how the shift input behaves. */
    uint32_t    shiftInput;         /**< Selects which input the shift uses. The inputs are device-specific. */
    uint32_t    serialInputMode;    /**< Configures how the serial input behaves. */
    uint32_t    serialInput;        /**< Selects which input the serial usese. Inputs are device-specific. */
    uint32_t    shiftRegOnDisable;  /**< Specifies the behavior of the ShiftReg outputs line_out and line_compl_out while the Shift Register is disabled. */
    uint32_t    trigger0Event;      /**< Configures which internal event generates on output trigger 0. */
    uint32_t    trigger1Event;      /**< Configures which internal event generates on output trigger 1. */
}cy_stc_tcpwm_shiftreg_config_t;

#else

