ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tcpwm_shiftreg.h
typedef struct cy_stc_tcpwm_shiftreg_config cy_stc_tcpwm_shiftreg_config_t;

#endif /* CY_IP_MXTCPWM_VERSION >= 2U */

/** \} group_tcpwm_data_structures_shiftreg */

/**
* \addtogroup group_tcpwm_macros_shiftreg
* \{
* \defgroup group_tcpwm_shiftreg_clk_prescalers Shift Register CLK Prescaler values
* \{
* Clock prescaler values.
*/
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_1      (0U) /**< Divide by 1 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_2      (1U) /**< Divide by 2 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_4      (2U) /**< Divide by 4 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_8      (3U) /**< Divide by 8 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_16     (4U) /**< Divide by 16 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_32     (5U) /**< Divide by 32 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_64     (6U) /**< Divide by 64 */
#define CY_TCPWM_SHIFTREG_PRESCALER_DIVBY_128    (7U) /**< Divide by 128 */
/** \} group_tcpwm_shiftreg_clk_prescalers */

/** \defgroup group_tcpwm_shiftreg_output_line Shift Register Output Lines
* Specifies the Shift Register output line.
* \{
*/
#define    CY_TCPWM_SHIFTREG_LINE_OUT         (0U)    /**< Shift Register Line output */
#define    CY_TCPWM_SHIFTREG_LINE_OUT_INV     (1U)    /**< Shift Register Line output compliment */
/** \} group_tcpwm_shiftreg_output_line */

/** \defgroup group_tcpwm_shiftreg_output_invert Shift Register output invert
* \{
* Output invert modes.
*/
#define CY_TCPWM_SHIFTREG_INVERT_ENABLE          (1U)  /**< Invert the output mode */
#define CY_TCPWM_SHIFTREG_INVERT_DISABLE         (0U)  /**< Do not invert the output mode */
/** \} group_tcpwm_shiftreg_output_invert */


/** \defgroup group_tcpwm_shiftreg_output_on_disable Shift Register Disabled Output
* Specifies the behavior of the Shift Register outputs while Shift Register is disabled.
* \{
*/
#define    CY_TCPWM_SHIFTREG_OUTPUT_HIGHZ    (0U)    /**< Shift Register output (default) high impedance */
#define    CY_TCPWM_SHIFTREG_OUTPUT_RETAIN   (1U)    /**< Shift Register outputs are retained */
#define    CY_TCPWM_SHIFTREG_OUTPUT_LOW      (2U)    /**< Shift Register output LOW */
#define    CY_TCPWM_SHIFTREG_OUTPUT_HIGH     (3U)    /**< Shift Register output HIGH */
/** \} group_tcpwm_shiftreg_output_on_disable */

/** \defgroup group_tcpwm_shiftreg_status Shift Register Status
* \{
* The Shift Register status.
*/
#define CY_TCPWM_SHIFTREG_STATUS_RUNNING (0x00008000UL) /**< Shift Register is running */
/** \} group_tcpwm_shiftreg_status */

/** \} group_tcpwm_macros_shiftreg */

/***************************************
*        Registers Constants
***************************************/

/** \cond INTERNAL */
#define CY_TCPWM_MODE_SHIFTREG           (7U)

/** \endcond */


/*******************************************************************************
*        Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_tcpwm_functions_shiftreg
* \{
*/

cy_en_tcpwm_status_t Cy_TCPWM_ShiftReg_Init(TCPWM_Type const *base, uint32_t cntNum, cy_stc_tcpwm_shiftreg_config_t const *config);
void Cy_TCPWM_ShiftReg_DeInit(TCPWM_Type const *base, uint32_t cntNum, cy_stc_tcpwm_shiftreg_config_t const *config);
#if (CY_IP_MXTCPWM_VERSION >= 2U) || defined (CY_DOXYGEN)
__STATIC_INLINE void Cy_TCPWM_ShiftReg_Enable(TCPWM_Type *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_Disable(TCPWM_Type *base, uint32_t cntNum);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetStatus(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetCompare0Val(TCPWM_Type *base, uint32_t cntNum, uint32_t compare0);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetCompare0Val(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetCompare0BufVal(TCPWM_Type *base, uint32_t cntNum, uint32_t compareBuf0);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetCompare0BufVal(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_EnableCompare0Swap(TCPWM_Type *base, uint32_t cntNum, bool enable);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetCompare1Val(TCPWM_Type *base, uint32_t cntNum, uint32_t compare1);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetCompare1Val(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetCompare1BufVal(TCPWM_Type *base, uint32_t cntNum, uint32_t compareBuf1);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetCompare1BufVal(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_EnableCompare1Swap(TCPWM_Type *base, uint32_t cntNum, bool enable);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetCounter(TCPWM_Type *base, uint32_t cntNum, uint32_t count);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetCounter(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE void Cy_TCPWM_ShiftReg_SetTaps(TCPWM_Type *base, uint32_t cntNum, uint32_t taps);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_GetTaps(TCPWM_Type const *base, uint32_t cntNum);
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_LineOutStatus (TCPWM_Type const *base, uint32_t cntNum, uint32_t shiftRegOutSelect);


/*******************************************************************************
* Function Name: Cy_TCPWM_ShiftReg_Enable
****************************************************************************//**
*
* Enables the counter in the TCPWM block for the Shift Register operation.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Enable
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_ShiftReg_Enable(TCPWM_Type *base, uint32_t cntNum)
{
    Cy_TCPWM_Enable_Single(base, cntNum);
}

/*******************************************************************************
* Function Name: Cy_TCPWM_ShiftReg_Disable
****************************************************************************//**
*
* Disables the counter in the TCPWM block.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_ShiftReg_Disable(TCPWM_Type *base, uint32_t cntNum)
{
    Cy_TCPWM_Disable_Single(base, cntNum);
}


